#!/bin/bash
#####		一键Ping测试			#####
#####		Author:xiaoz.me			#####
#####		Update:2019-06-03		#####

PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/bin:/sbin
export PATH

#获取服务器公网IP
osipv4=$(curl -s https://api-ipv4.ip.sb/ip)
osipv6=$(curl -s https://api-ipv6.ip.sb/ip)

location=(
		'安徽电信'
		'北京电信'
		'福建电信'
		'甘肃电信'
		'广东电信'
		'广西电信'
		'贵州电信'
		'河南电信'
		'湖北电信'
		'湖南电信'
		'江苏电信'
		'江西电信'
		'内蒙古电信'
		'陕西电信'
		'上海电信'
		'四川电信'
		'天津电信'
		'云南电信'
		'浙江电信'
		'北京联通'
		'重庆联通'
		'广东联通'
		'河北联通'
		'河南联通'
		'黑龙江联通'
		'吉林联通'
		'江苏联通'
		'内蒙古联通'
		'山东联通'
		'山西联通'
		'陕西联通'
		'上海联通'
		'四川联通'
		'浙江联通'
		'江苏移动'
		'安徽移动'
		'山东移动'
	)
#各地区DNS，来源于http://dns.lisect.com/ and https://www.ip.cn/dns.html
#https://www.dnsdizhi.com/
dnsip=(
	'61.132.163.68'      #安徽电信
	'218.30.26.68'       #北京电信
	'218.85.152.99'      #福建电信
	'202.100.64.66'      #甘肃电信
	'202.96.128.86'      #广东电信
	'222.172.200.68'     #广西电信
	'202.98.192.67'      #贵州电信
	'222.88.88.88'       #河南电信
	'202.103.0.117'      #湖北电信
	'61.187.191.3'       #湖南电信
	'218.2.2.2'          #江苏电信
	'202.101.224.69'     #江西电信
	'222.74.1.200'       #内蒙古电信
	'218.30.19.40'       #陕西电信
	'202.96.209.133'     #上海电信
	'61.139.2.69'        #四川电信
	'219.150.32.132'     #天津电信
	'222.172.200.68'     #云南电信
	'122.225.44.58'      #浙江电信
	'211.167.242.34'     #北京联通
	'221.5.203.98'       #重庆联通
	'210.21.196.6'       #广东联通
	'202.99.160.68'      #河北联通
	'61.158.160.197'     #河南联通
	'202.97.224.69'      #黑龙江联通
	'202.98.0.68'        #吉林联通
	'58.241.84.5'        #江苏联通
	'202.99.224.68'      #内蒙古联通
	'202.102.128.68'     #山东联通
	'202.99.216.113'     #山西联通
	'221.11.1.67'        #陕西联通
	'203.95.1.2'         #上海联通
	'119.6.6.6'          #四川联通
	'221.12.1.227'       #浙江联通
	'221.131.143.69'     #江苏移动
	'211.138.180.2'      #安徽移动
	'218.201.96.130'     #山东移动
)
echo '---------------------------------------------------------------------------'
echo "您的本机IPV4为：[$osipv4]"
echo "您的本机IPV6为：[$osipv6]"
function mping(){
	num=0
	#Ping次数
	#pnum=$1
	pnum=10

	#echo '---------------------------------------------------------------------------'
	echo "正在进行Ping测试，请稍后..."
	echo '---------------------------------------------------------------------------'

	while(( $num<39 ))
	do
		ping ${dnsip[$num]} -c $pnum > /tmp/${dnsip[$num]}.txt
		echo 【${location[$num]}】 - ${dnsip[$num]}
		echo ''
		tail -2 /tmp/${dnsip[$num]}.txt
		echo '---------------------------------------------------------------------------'
		let "num++"
	done
	echo "【参数说明】"
	echo "x% packet loss: 丢包率"
	echo "min: 最低延迟"
	echo "avg: 平均延迟"
	echo "max: 最高延迟"
	echo "mdev: 平均偏差"

	echo '---------------------------------------------------------------------------'
}


mping 42
echo ''
