#!/bin/bash
#####		一键Ping测试			#####
#####		Author:xiaoz.me			#####
#####		Update:2019-06-03		#####

PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/bin:/sbin
export PATH

#获取服务器公网IP
osip=$(curl https://api.ttt.sh/ip/qqwry/?type=txt)

location=(
		'安徽电信'
		'北京电信'
		'福建电信'
		'甘肃电信'
		'广东电信'
		'广西电信'
		'贵州电信'
		'河南电信'
		'湖北电信'
		'湖南电信'
		'江苏电信'
		'江西电信'
		'内蒙古电信'
		'山东电信'
		'陕西电信'
		'上海电信'
		'四川电信'
		'天津电信'
		'云南电信'
		'浙江电信'
		'北京联通'
		'重庆联通'
		'广东联通'
		'河北联通'
		'河南联通'
		'黑龙江联通'
		'吉林联通'
		'江苏联通'
		'内蒙古联通'
		'山东联通'
		'山西联通'
		'陕西联通'
		'上海联通'
		'四川联通'
		'天津联通'
		'浙江联通'
		'辽宁联通'
		'江苏移动'
		'安徽移动'
		'山东移动'
	)
#各地区DNS，来源于http://dns.lisect.com/ and https://www.ip.cn/dns.html
#https://www.dnsdizhi.com/
dnsip=(
	'61.132.163.68'
	'218.30.26.68'
	'218.85.152.99'
	'202.100.64.66'
	'202.96.128.86'
	'222.172.200.68'
	'202.98.192.67'
	'222.88.88.88'
	'202.103.24.68'
	'222.246.129.80'
	'218.2.2.2'
	'202.101.224.69'
	'219.148.162.31'
	'219.146.1.66'
	'218.30.19.40'
	'202.96.209.133'
	'61.139.2.69'
	'219.150.32.132'
	'222.172.200.68'
	'202.101.172.35'
	'123.123.123.123'
	'221.5.203.98'
	'210.21.196.6'
	'202.99.160.68'
	'202.102.224.68'
	'202.97.224.69'
	'202.98.0.68'
	'221.6.4.66'
	'202.99.224.68'
	'202.102.128.68'
	'202.99.192.66'
	'221.11.1.67'
	'210.22.70.3'
	'119.6.6.6'
	'202.99.104.68'
	'221.12.1.227'
	'202.96.69.38'
	'221.131.143.69'
	'211.138.180.2'
	'218.201.96.130'
)
echo '---------------------------------------------------------------------------'
echo "您的本机IP为：[$osip]"
function mping(){
	num=0
	#Ping次数
	pnum=$1

	#echo '---------------------------------------------------------------------------'
	echo "正在进行Ping测试，请稍后..."
	echo '---------------------------------------------------------------------------'

	while(( $num<40 ))
	do
		ping ${dnsip[$num]} -c $pnum > /tmp/${dnsip[$num]}.txt
		echo 【${location[$num]}】 - ${dnsip[$num]}
		echo ''
		tail -2 /tmp/${dnsip[$num]}.txt
		echo '---------------------------------------------------------------------------'
		let "num++"
	done
	echo "【参数说明】"
	echo "x% packet loss: 丢包率"
	echo "min: 最低延迟"
	echo "avg: 平均延迟"
	echo "max: 最高延迟"
	echo "mdev: 平均偏差"

	echo '---------------------------------------------------------------------------'
}


mping 42
echo ''
